# Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень). Напишите решения через list и через dict.

"""Че то не получается ("""

month = int(input('Введите месяц в виде числа -'))
my_dict = {
    1: 'Январь',
    2: 'Февраль',
    3: 'Март',
    4: 'Апрель',
    5: 'Май',
    6: 'Июнь',
    7: 'Июль',
    8: 'Август',
    9: 'Сентябрь',
    10: 'Октябрь',
    11: 'Ноябрь',
    12: 'Декабрь'
}
season_dict = {
    0: 'Зима',
    1: 'Февраль',
    2: 'Март',
    3: 'Апрель'
}
# list_month = list(my_dict)
# list_season = list(season)
if month in my_dict:
    print(f'Месяц {month}-й это время года {month / 3, [season_dict]}')
else:
    print('Ошибка')
