# Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление.
# Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.

num_1 = int(input('Введите первое положительное число - '))
num_2 = int(input('Введите второе положительное число - '))

def calc(num_1, num_2):
    if num_1 <= 0 or num_2 <= 0:
        return f'Делить на "ноль" нельзя ! Укажите другое число'
    else:
        return f'Результат деления {num_1} на {num_2} = {num_1 / num_2}'

result = calc(num_1, num_2)
print(result)

# Почему результат типа folse а не int ?