# Реализовать функцию my_func(), которая принимает три позиционных аргумента, и возвращает сумму наибольших двух аргументов.
a = 10
b = 15
c = 20

def funk(*args):
     return sum(args) - min(args)

# print(sum(funk(a, b, c)) - min(funk(a, b, c)))
print(funk(a, b, c))

# Результат верный но вот решение ... я убираю минимальный а надо именно суммировать два максимальных, не знаю как выбрать два максимальых)